duplico/badge.lgbt/uniflash_windows_animloader-2021-r1/ccs_base/common/targetdb/Modules/CC26xx/CC26x0R2F/CC26xx_JSTATE_2_NotVisible.xml
<?xml version="1.0" encoding="UTF-8"?>
<module HW_revision="2.0" XML_version="1" description="JSTATE decoding" id="Hidden" hidden="true">
  <register acronym="JSTATE4" description="Digital JTAG State Register" id="JSTATE4" offset="0x0" width="64">
    <!-- Peripherals: Voltage & Power domains -->
    <bitfield id="MODACT0"  begin="22" end="21" width="2"  description="MCU.MCU_VD%V_DOMAIN"    range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT1"  begin="16" end="16" width="1"  description="MCU.VIMS_PD"            range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT2"  begin="17" end="17" width="1"  description="MCU.RFCORE_PD"          range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT3"  begin="18" end="18" width="1"  description="MCU.PERIPH_PD"          range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT4"  begin="19" end="19" width="1"  description="MCU.SERIAL_PD"          range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT5"  begin="20" end="20" width="1"  description="MCU.CPU_PD"             range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT6"  begin="25" end="24" width="2"  description="AON.AUX_PD%V_DOMAIN"    range="" resetval="0" rwaccess="R"/>
    <!-- Peripherals: MISC -->
    <bitfield id="MODACT7"  begin="35" end="30" width="6"  description="Interrupts%HWI"         range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT8"  begin="7"  end="0"  width="8"  description="USER_DATA"              range="" resetval="0" rwaccess="R"/>
    <!-- Peripherals: Signals -->
    <bitfield id="MODACT9"  begin="8"  end="8"  width="1"  description="OBS_SIG.0"              range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT10" begin="9"  end="9"  width="1"  description="OBS_SIG.1"              range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT11" begin="10" end="10" width="1"  description="OBS_SIG.2"              range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT12" begin="11" end="11" width="1"  description="OBS_SIG.3"              range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT13" begin="61" end="61" width="1"  description="OBS_SIG.4"              range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT14" begin="62" end="62" width="1"  description="OBS_SIG.5"              range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT15" begin="63" end="63" width="1"  description="OBS_SIG.6"              range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT16" begin="58" end="58" width="1"  description="WARM_RESET"             range="" resetval="0" rwaccess="R"/>
    <bitfield id="MODACT17" begin="57" end="57" width="1"  description="PC_Error"               range="" resetval="0" rwaccess="R"/>
    <!-- PC -->
    <bitfield id="PC"       begin="56" end="36" width="21" description="PC"                     range="" resetval="0" rwaccess="R"/>
    <!-- "PWRSTATE0" is always the main core -->
    <bitfield id="PWRSTATE0"    begin="60" end="59" width="2"  description="CPU%CORTEXM_PM"     range="" resetval="0" rwaccess="R"/>
    <bitfield id="PWRSTATE1"    begin="15" end="12" width="4"  description="RF%LPRF_PM"         range="" resetval="0" rwaccess="R"/>
    <bitfield id="PWRSTATE2"    begin="23" end="23" width="1"  description="Sensor_Controller"  range="" resetval="0" rwaccess="R"/>
  </register>
</module>
